<!DOCTYPE doctype PUBLIC "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
                            
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
                            
  <meta name="GENERATOR" content="Mozilla/4.78 [en] (X11; U; Linux 2.4.7 i686) [Netscape]">
  <title>Universidade Federal do Rio Grande do Norte - Divulga&ccedil;&atilde;o de Resultados de Pesquisa</title>
</head>
<body>
           
<table border="0" cellspacing="0">
       <caption>&nbsp; <br>
        </caption><tbody>
                       
  </tbody><tbody>
                         
  </tbody>  <tbody>
    <tr>
      <td valign="CENTER"><a href="http://www.ualberta.ca/"><img src="gifs/ua.gif" alt="University of Alberta" border="0" height="87" width="87"> <a href="https://www.ufrn.br"><img src="gifs/UFRN.png" alt="Universidade Federal do Rio Grande do Norte" border="0" height="87" width="87"> </a>
      </td>
      <td valign="CENTER">                                           
	<center><h1> Divulga&ccedil;&atilde;o de Resultados de Pesquisa </h1></center>
	<img src="gifs/rainbowline.gif" height="2" width="100%">                                     
	<p>Universidade Federal do Rio Grande do Norte</p>
      </td>
       </tr>
                         
  </tbody>      
</table>
              
<p><img src="gifs/rainbowline.gif" height="2" width="100%">
       </p>
             
<center>       
<p><i><font face="Helvetica"><font size="+1">Revisado em 15 de Maio de 2025</font></font></i></p>
      </center>
              
<p><img src="gifs/rainbowline.gif" height="2" width="100%">
       </p>
           
<h2> Hor&aacute;rio </h2>

<p>
<table border=0 width="50%" nosave="">
  <tbody>
    <tr>
      <td>  <b>Dia</b> </td> <td> <b>Hor&aacute;rio</b> </td>
    </tr>
    <tr>
      <td> 02 de Junho (Segunda) </td> <td> 13:00-14:30 </td>
    </tr>
        <tr>
      <td> 04 de Junho (Quarta) </td> <td> 13:00-14:30 </td>
      </tr>
    <tr>
      <td> 06 de Junho (Sexta) </td> <td> 13:00-14:30 </td>
      </tr>
      <tr>
	<td> 09  de Junho (Segunda) </td> <td>  13:00-14:30 </td>
      </tr>
      <tr>
	<td> 11 de Junho (Quarta) </td> <td> 13:00-14:30 </td>
      </tr>
      <tr>
	<td> 13 de Junho (Sexta) </td> <td> 13:00-14:30 </td>
      </tr>
    </tbody>
  </table>
  
  <p>   <b> Local</b>:  Auditório do Núcleo de Pesquisa e Inovação em Tecnologia da Informação - nPITI</p>

  <p> <b>Instrutor</b>: <a href="https://webdocs.cs.ualberta.ca/~amaral/">
    J. Nelson Amaral</a> </p>
           
<p><img src="gifs/rainbowline.gif" height="2" width="100%">
       </p>
           

  <h2> Descri&ccedil;&atilde;o do Curso </h2>
  
<p>A divulga&ccedil;&atilde;o e publica&ccedil;&atilde;o de novas id&eacute;ias e de resultados de investiga&ccedil;&atilde;o cient&iacute;fica &eacute; de responsibilidade de todo pesquisador. Esta divulga&ccedil;&atilde;o toma muitos formatos, incluindo manuscritos submetidos para confer&ecirc;ncias e peri&oacute;dicos, notas para a imprensa, apresenta&ccedil;&otilde;es formais em confer&ecirc;ncias, workshops, semin&aacute;rios, mini cursos, m&iacute;dia social.</p>

  <p>Este curso esta aberto a alunos de quaisquer &aacute;reas de Ci&ecirc;ncia e Tecnologia. Podem participar alunos no ultimo ano de gradua&ccedil;&atilde;o, em qualquer nivel de p&oacute;s-gradua&ccedil;&atilde;o, e p&oacute;s-doutores.</p>

<p>Tipicamente estas apresenta&ccedil;&otilde;es cont&eacute;m uma sumariza&ccedil;&atilde;o de
id&eacute;ias e uma lista de resultados de pesquisa. Frequentemente muitos
resultados experimentais precisam ser agregados em poucos n&uacute;meros
para embasar a lista de contribui&ccedil;&otilde;es apresentadas como resultados. Um
dos objetivos deste curso &eacute; analisar os m&eacute;todos que devem ser
utilizados para computar estas agrega&ccedil;&otilde;es e os cuidados que se deve
ter ao escrever uma lista de contribui&ccedil;&otilde;es. O curso vai analisar v&aacute;rios
erros que s&atilde;o usualmente cometidos por pesquisadores ao criar,
apresentar e sumarizar, e tamb&eacute;m na cria&ccedil;&atilde;o de gr&aacute;ficos e
tabelas. Ser&atilde;o tamb&eacute;m vistos erros comuns na escrita de sum&aacute;rios de
contribui&ccedil;&otilde;es cient&iacute;ficas.</p>

<p>Este curso tamb&eacute;m vai cobrir m&eacute;todos de apresenta&ccedil;&atilde;o oral. Tanto apresenta&ccedil;&otilde;es longas no formato de uma palestra ou uma aula, como apresenta&ccedil;&otilde;es de dura&ccedil;&atilde;o muito curta em que somente os pontos mais relevantes podem ser mencionados.</p>

<p>O curso vai ter o formato de semin&aacute;rio, com discuss&atilde;o de artigos que tratam de metodologia experimental e de t&eacute;cnicas de apresenta&ccedil;&atilde;o.</p>

<p>O curso tamb&eacute;m vai discutir as melhores pr&aacute;ticas em
rela&ccedil;&atilde;o ao processo de revis&atilde;o de artigos. Tanto do
ponto de vista de um autor que submete um manuscrito para revis&atilde;o,
como de um revisor.  </p>

<p> Este artigo reporta sobre uma vers&atilde;o anterior do curso: <a href="https://dcc.ufmg.br/10387-2/">Departamento de Ci&ecirc;ncias da Computa&ccedil;&atilde;o (UFMG) e Universidade de Alberta: parceria de sucesso e reflexão sobre como cientistas falam sobre resultados de pesquisa</a>
</p>
           
<p><img src="gifs/rainbowline.gif" height="2" width="100%">
       </p>

<h2> Plano de Atividades</h2>

<ul>
  <li> <b> Encontro 1:</b> 
  <ul>
    <li> Apresenta&ccedil;&otilde;es Pessoais</li>
    <li> Estrutura do Curso </li>
    <li> <a href="ApresentacoesOrais.pptx">Apresenta&ccedil;&otilde;es Verbais de Resultado de Pesquisa</a> </li>
    <ul>
      <li> Preparando Slides:
      <ul>
	<li> Planejando e a reflex&atilde;o necess&aacute;ria para preparar slides. </li>
	<li> Listas em slides e como o c&eacute;rebro funciona. </li>
	<li> Mostrando gr&aacute;ficos complexos. </li>
	<li> Comunica&ccedil;&atilde;o orientada ao orador e comunica&ccedil;&atilde;o orientada ao ouvinte. </li>
      </ul></li>
      <li> Fazendo uma apresenta&ccedil;&atilde;o:
      <ul>
	<li> Ensaiando e se preparando </li>
	<li> Os dois primeiros minutos cr&iacute;ticos </li>
	<li> Onde est&aacute; a sua audi&ecirc;ncia? O que eles est&atilde;o pensando? </li>
	<li> Ritmo de fala e uso de pausas </li>
	<li> Interagindo com a plat&eacute;ia </li>
	<li> A apresenta&ccedil;&atilde;o de elevador </li>
      </ul></li>
      <li> Organiza&ccedil;&atilde;o:
      <ul>
	<li> Especifica&ccedil;&atilde;o do problema </li>
	<li> Coer&ecirc;ncia entre conclus&otilde;es e dados </li>
	<li> Cria&ccedil;&atilde;o de suspense </li>
      </ul></li>
    </ul></li>
  </ul></li>
  <li> <b> Encontro 2:</b>
  <ul>
    <li> Discuss&atilde;o de Artigos:
    <ul>
      <li> Stephen M. Blackburn, Amer Diwan, Matthias Hauswirth, Peter F. Sweeney, Jos&eacute; Nelson Amaral, Tim Brecht, Lubom&iacute;r Bulej, Cliff Click, Lieven Eeckhout, Sebastian Fischmeister, Daniel Frampton, Laurie J. Hendren, Michael Hind, Antony L. Hosking, Richard E. Jones, Tomas Kalibera, Nathan Keynes, Nathaniel Nystrom, and Andreas Zeller, <a href="papers/BlackburnTOPLAS16.pdf">"The Truth, the Whole Truth, and Nothing but the Truth: A Pragmatic Guide to Assessing Empirical Evaluations,"</a> ACM Transactions on Programming Languages and Systems (TOPLAS), Volume 38, Issue 4, Article 15, October 2016. </li>
      <li> <a href="http://evaluate.inf.usi.ch/anti-patterns"> Evaluation Anti-Patterns </a></li>
      <li> Alan Jay Smith <a href="papers/SmithIEEE90.pdf"> "The Task of the Referee"</a>, IEEE Computer, April, 1989, pp. 65-71.</li>
    </ul></li>
  </ul></li>
    
  <li> <b> Encontro 3:</b> 
  <ul>
    <li> Sumariza&ccedil;&atilde;o de resultados e escrita de conclus&otilde;es </li>
    <li> Discuss&atilde;o de Artigos:
    <ul>
      <li> John Ousterhout, <a href="papers/OusterhoutCACM18.pdf">"Always Measure One Level Deeper,"</a> <i>Communications of the ACM</i>, July 2018, Vol. 61, No. 7, pages 74-83.</li>
    </ul></li>
    <li> Apresenta&ccedil;&otilde;es em Aula</li>
  </ul></li>
	
  <li> <b> Encontro 4:</b>

  
  <ul>
    <li> Discuss&atilde;o de Revis&otilde;es </li>
    <li> Escrevendo uma respostas para revis&otilde;es
    <ul>
      <li> Resposta a revis&otilde;es para confer&ecirc;ncias </li>
      <li> Preparando revis&otilde;es para artigos submetidos para peri&oacute;dicos </li>
    
    </ul></li>
    </li>
    <li> Apresenta&ccedil;&otilde;es em Aula </li>
  </ul></li>
    
  <li> <b> Encontro 5:</b>
  <ul>
    <li> Discuss&atilde;o de Artigo:
    <ul>
      <li> Marie desJardins, <a href="papers/desJardinsOnline95.pdf">"How to Succeed in Graduate School:
      A Guide for Students and Advisors,"</a> <i>Online ACM Student Magazine</i>,
      issues 1.2 (December 1994) and 1.3 (January 1995).</li>
      <li> Discussao do video: <a href="https://youtu.be/WP-FkUaOcOM">How to Write a Great Research Paper</a></li>
      <li J. Nelson Amaral, <a href="papers/Amaral-research-methods.pdf">"About Computing Science Research Methodology"</a>, Unpublished, 2007.</li>
    </ul></li>
    <li> Apresenta&ccedil;&otilde;es em Aula </li>
  </ul></li>
</ul>

 <li> <b> Encontro 6:</b>
  <ul>
    <li>Presentation: "How did <b><i>this</i></b> get published?" by J. Nelson Amaral</li>
    <li> Apresenta&ccedil;&otilde;es em Aula </li>
    <li> Apresenta&ccedil;&otilde;es de Elevador </li>
  </ul></li>
</ul>


<h2> Refer&ecirc;ncias:</h2>

<ul>
  <li> Michael Alley, <i><a href="https://link.springer.com/book/10.1007/978-1-4419-8279-7">The Craft of Scientific Presentation</a></i>, Springer, 2013.
  </li>
  </lu>
  
<h2>Tarefas, Temas de Casa, Apresenta&ccedil;&otilde;es</h2>
           

<h3>Apresenta&ccedil;&otilde;es em Aula</h3>

Cada aluno vai preparar e fazer uma breve apresenta&ccedil;&atilde;o em aula usando slides. Depois de cada pequeno grupo de apresenta&ccedil;&otilde;es, a classe vai oferecer sugest&otilde;es de como a apresenta&ccedil;&atilde;o poderia ser melhor organizada ou melhor apresentada.</p>

Marque o hor&aacute;rio de sua apresenta&ccedil;&atilde;o <a href="https://docs.google.com/spreadsheets/d/1SLq-sIuZLsTOInG9KSWBpNSFu_W7Ny0cSPqc2fa_l_E/edit?usp=sharing">nesta planilha</a>. 
  
<h3>Revis&atilde;o de Artigo</h3>

Cada aluno vai escrever uma revis&atilde;o de um artigo, j&aacute; publicado, a sua escolha. Esta revis&atilde;o deve serguir as recomenda&ccedil;&otilde;es revisadas em aula para uma boa revis&atilde;o.</p>

<p>Adicione o artigo que voce vai revisar nesta pasta: <a href="https://drive.google.com/drive/folders/1Htali-iZYJuZiZYNvlkmK9T-ZsmyM9d2?usp=drive_link">pasta para artigos</a></p>
  
<p>Para dar nome ao arquivo contendo o artigo, use o &uacute;ltimo nome do primeiro autor, seguido
da sigla da confer&egrave;ncia ou do peri&oacute;dico, seguido dos dois &uacute;ltimos digitos do ano, e depois
seguido de um hiphen, o seu primeiro nome, um hiphen, o seu ultimo nome, e .pdf</p>


<p>Exemplos: </p>

<p>Bruno Coutinho, Diogo Sampaio, Fernando Magno Quintao Pereira, Wagner Meira Jr.,
   Divergence analysis and optimizations, International Conference on Parallel
   Architectures and Compilation Techniques, Gavelston, TX, USA, October, 2011.</p>

<p>Se o Nelson Amaral for revisar este artigo, o nome arquivo deve ser: CoutinhoPACT11-Nelson-Amaral.pdf</p>

<p>Juan Salamanca, Jos&eacute; Nelson Amaral and Guido Ara&uacute;jo, Using Hardware-Transactional-Memory
   Support to Implement Thread-Level Speculation, IEEE Transactions on Parallel and Distributed
Systems, Vol. 29, Issue 2, February, 2018, pp. 466-480.</p>

<p>Se o Andrei Alvares fosse revisar este artigo, ele criaria o nome: SalamancaTPDS18-Andrei-Alvares.pdf</p>

<p>Coloque a sua revis&atilde;o neste drive: <a href="https://drive.google.com/drive/folders/11SFtTJNay9DV9O7zczwKBhe9wyLC86-y?usp=drive_link">pasta para revis&otilde;es</a></p>

<p>O arquivo contendo a revis&atilde;o deve ser um arquivo simples contendo ASCII characters. O nome destes archivos
devem seguir o mesmo padr&atildeo acima, com a adicao the -rev ao nome do arquivo, conforme os exemplos:<p>

<p>CoutinhoPACT11-Nelson-Amaral-rev.pdf<br>
SalamancaTPDS18-Andrei-Alvares-rev.pdf</p>


<h3>Cr&iacute;tica de Revis&atilde;o de Artigo</h3>

<p>Cada aluno vai preparar duas cr&iacute;ticas a revis&atilde;o de artigos que foram feitas por colegas. Esta cr&iacute;tica deve indicar em como a revis&atilde;o seguiu os princ&iacute;pios discutidos em aula e em que asp&eacute;ctos a revis&atilde;o poderia ser melhorada.</p>

<p> <a href="https://docs.google.com/spreadsheets/d/1PbqvIVawjc88jvbx0DPRP0MT0N7NLirfBAyK_M0S0hI/edit?usp=sharing">Nesta planilha</a> coloque o seu nome na frente de duas revisoes, que nao sejam a sua, que voce vai criticar.

<p>Coloque a critica de revisao nesta pasta: <a href="https://drive.google.com/drive/folders/1dfTInBxnl6MumXhxjtmwiSXUzbm6oF2b?usp=drive_link">pasta para critica de revisoes</a>

<h3>Apresenta&ccedil;&otilde;es de Elevador</h3>

Cada aluno vai fazer uma apresenta&ccedil;&atilde;o de elevador (em p&eacute;, m&aacute;ximo tr&ecirc;s minutos, sem usar slides). Depois de um pequeno grupo de apresenta&ccedil;&otilde;es a classe vai oferecer sugest&otilde;es sobre como melhorar a apresenta&ccedil;&atilde;o.</p>


 
</body>
</html>
